#!/bin/bash

# Базовые директории
mkdir -p База_данных
mkdir -p Приказы_и_распоряжения

# Директории для проектов
mkdir -p Проекты/Горизонт-2030/Графические_документы/ДСП
mkdir -p Проекты/Горизонт-2030/Графические_документы/Несекретно
mkdir -p Проекты/Горизонт-2030/Графические_документы/Секретно

mkdir -p Проекты/Горизонт-2030/Текстовые_документы/ДСП
mkdir -p Проекты/Горизонт-2030/Текстовые_документы/Несекретно
mkdir -p Проекты/Горизонт-2030/Текстовые_документы/Секретно

# Черновики
mkdir -p Проекты/Горизонт-2030/Черновики/Громов
mkdir -p Проекты/Горизонт-2030/Черновики/Кузнецов
mkdir -p Проекты/Горизонт-2030/Черновики/Рябов

# Остальные проекты
mkdir -p Проекты/Машина_4.0
mkdir -p Проекты/ЭкоЭнергия

# Директории для экономики
mkdir -p Экономика/Канцелярские_товары_НС
mkdir -p Экономика/Продажи_ДСП
